//напишите программу,котрая принимает число А и выдает произвеедение чисел,входящих в него
// int GetProductofnumbers (int A)
// {
//     int sum=1;

//     for(int i =1;i<=A;i++)
//     {
//     sum*=i;
//     }
//     return sum;
// }
// Console.Write("введите число:");
// int N=int.Parse(Console.ReadLine()!);//считывает и образует строку
// Console.WriteLine(GetProductofnumbers(N));

