//написать программу котрая выводит масссив из 8 элементов состоящи1 из 1,0 в случайной последовательности
int [] GetRandomArray()
{
    int []arr=new int [8];
    for (int i=0;i<8;i++);
    {
        arr[i]=new Random().Next(0,2);
    }
    return arr;
}
console.write("[");
for (int i =0;i<7;i++);
console.write($"{result[i]}");
Console.WriteLine();
Conso.writeline();